flagsmith/2024-08-20--00002--staging/local-eval-report.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: local_eval_script.js
 web dashboard: http://127.0.0.1:5665
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m0s max duration (incl. graceful stop):
              * default: Up to 1000 looping VUs for 30s over 1 stages (gracefulRampDown: 10s, gracefulStop: 30s)


     ✓ status is 200
     ✓ flag should be true

     checks.........................: 100.00% ✓ 23486      ✗ 0     
     data_received..................: 19 MB   596 kB/s
     data_sent......................: 1.1 MB  33 kB/s
     http_req_blocked...............: avg=4.97ms   min=104ns   med=307ns    max=1.36s    p(90)=620ns    p(95)=39.72ms 
     http_req_connecting............: avg=2.68ms   min=0s      med=0s       max=1.05s    p(90)=0s       p(95)=17.4ms  
     http_req_duration..............: avg=350.26ms min=16.4ms  med=263.07ms max=1.94s    p(90)=815.31ms p(95)=981.1ms 
       { expected_response:true }...: avg=350.26ms min=16.4ms  med=263.07ms max=1.94s    p(90)=815.31ms p(95)=981.1ms 
     http_req_failed................: 0.00%   ✓ 0          ✗ 11743 
     http_req_receiving.............: avg=36.58µs  min=13.49µs med=29.12µs  max=536.26µs p(90)=56.43µs  p(95)=75.24µs 
     http_req_sending...............: avg=40.57µs  min=14.46µs med=29.99µs  max=1.19ms   p(90)=72.95µs  p(95)=97.81µs 
     http_req_tls_handshaking.......: avg=2.25ms   min=0s      med=0s       max=463.57ms p(90)=0s       p(95)=21.44ms 
     http_req_waiting...............: avg=350.18ms min=16.34ms med=262.98ms max=1.94s    p(90)=815.24ms p(95)=980.98ms
     http_reqs......................: 11743   370.748902/s
     iteration_duration.............: avg=1.35s    min=1.01s   med=1.26s    max=2.94s    p(90)=1.82s    p(95)=1.98s   
     iterations.....................: 11743   370.748902/s
     vus............................: 450     min=39       max=996 
     vus_max........................: 1000    min=1000     max=1000


running (0m31.7s), 0000/1000 VUs, 11743 complete and 0 interrupted iterations
default ✓ [======================================] 0000/1000 VUs  30s