flagsmith/2024-08-20--00002--staging/server-eval-with-proxy-report.txt

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: server_eval_with_proxy_script.js
 web dashboard: http://127.0.0.1:5665
        output: -

     scenarios: (100.00%) 1 scenario, 1000 max VUs, 1m0s max duration (incl. graceful stop):
              * default: Up to 1000 looping VUs for 30s over 1 stages (gracefulRampDown: 10s, gracefulStop: 30s)


     ✓ status is 200
     ✗ flag should be true
      ↳  96% — ✓ 2786 / ✗ 95

     checks.........................: 98.35% ✓ 5667      ✗ 95    
     data_received..................: 7.2 MB 172 kB/s
     data_sent......................: 728 kB 17 kB/s
     http_req_blocked...............: avg=28.37ms min=142ns   med=359ns   max=2.39s    p(90)=51.38ms  p(95)=67.14ms 
     http_req_connecting............: avg=17.76ms min=0s      med=0s      max=2.09s    p(90)=23.71ms  p(95)=31.14ms 
     http_req_duration..............: avg=6.5s    min=27.15ms med=6.18s   max=21.11s   p(90)=11.94s   p(95)=13.08s  
       { expected_response:true }...: avg=6.5s    min=27.15ms med=6.18s   max=21.11s   p(90)=11.94s   p(95)=13.08s  
     http_req_failed................: 0.00%  ✓ 0         ✗ 2881  
     http_req_receiving.............: avg=38.76µs min=16.33µs med=33.04µs max=367.84µs p(90)=59.48µs  p(95)=71.77µs 
     http_req_sending...............: avg=58.47µs min=14.76µs med=44.08µs max=348.24µs p(90)=104.57µs p(95)=124.11µs
     http_req_tls_handshaking.......: avg=10.47ms min=0s      med=0s      max=601.55ms p(90)=26.7ms   p(95)=33.36ms 
     http_req_waiting...............: avg=6.5s    min=27.01ms med=6.18s   max=21.11s   p(90)=11.94s   p(95)=13.08s  
     http_reqs......................: 2881   68.722874/s
     iteration_duration.............: avg=7.53s   min=1.06s   med=7.2s    max=22.18s   p(90)=12.97s   p(95)=14.17s  
     iterations.....................: 2881   68.722874/s
     vus............................: 2      min=2       max=997 
     vus_max........................: 1000   min=1000    max=1000


running (0m41.9s), 0000/1000 VUs, 2881 complete and 0 interrupted iterations
default ✓ [======================================] 0000/1000 VUs  30s